Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/dma.h
#define DMA_CHEVCTRL_EVAUXACT_Pos             _UINT32_(0)                                          /* (DMA_CHEVCTRL) Channel Auxiliary Event Input Action Position */
#define DMA_CHEVCTRL_EVAUXACT_Msk             (_UINT32_(0x3) << DMA_CHEVCTRL_EVAUXACT_Pos)         /* (DMA_CHEVCTRL) Channel Auxiliary Event Input Action Mask */
#define DMA_CHEVCTRL_EVAUXACT(value)          (DMA_CHEVCTRL_EVAUXACT_Msk & (_UINT32_(value) << DMA_CHEVCTRL_EVAUXACT_Pos)) /* Assigment of value for EVAUXACT in the DMA_CHEVCTRL register */
#define   DMA_CHEVCTRL_EVAUXACT_ABORT_BLK_XFER_Val _UINT32_(0x0)                                        /* (DMA_CHEVCTRL) Event Aborts Bock Transfer  */
#define   DMA_CHEVCTRL_EVAUXACT_INCR_CHN_PRI_Val _UINT32_(0x1)                                        /* (DMA_CHEVCTRL) Event Increments Channel Priority  */
#define   DMA_CHEVCTRL_EVAUXACT_COND_TRIG_Val _UINT32_(0x2)                                        /* (DMA_CHEVCTRL) Event acts as a Conditional Trigger  */
#define DMA_CHEVCTRL_EVAUXACT_ABORT_BLK_XFER  (DMA_CHEVCTRL_EVAUXACT_ABORT_BLK_XFER_Val << DMA_CHEVCTRL_EVAUXACT_Pos) /* (DMA_CHEVCTRL) Event Aborts Bock Transfer Position  */
#define DMA_CHEVCTRL_EVAUXACT_INCR_CHN_PRI    (DMA_CHEVCTRL_EVAUXACT_INCR_CHN_PRI_Val << DMA_CHEVCTRL_EVAUXACT_Pos) /* (DMA_CHEVCTRL) Event Increments Channel Priority Position  */
#define DMA_CHEVCTRL_EVAUXACT_COND_TRIG       (DMA_CHEVCTRL_EVAUXACT_COND_TRIG_Val << DMA_CHEVCTRL_EVAUXACT_Pos) /* (DMA_CHEVCTRL) Event acts as a Conditional Trigger Position  */
#define DMA_CHEVCTRL_EVOMODE_Pos              _UINT32_(2)                                          /* (DMA_CHEVCTRL) Channel Event Output Mode Position */
#define DMA_CHEVCTRL_EVOMODE_Msk              (_UINT32_(0x3) << DMA_CHEVCTRL_EVOMODE_Pos)          /* (DMA_CHEVCTRL) Channel Event Output Mode Mask */
#define DMA_CHEVCTRL_EVOMODE(value)           (DMA_CHEVCTRL_EVOMODE_Msk & (_UINT32_(value) << DMA_CHEVCTRL_EVOMODE_Pos)) /* Assigment of value for EVOMODE in the DMA_CHEVCTRL register */
#define   DMA_CHEVCTRL_EVOMODE_STRB_ON_BLCK_XFER_Val _UINT32_(0x0)                                        /* (DMA_CHEVCTRL) Generate a channel event strobe for 1 clock cycle at the end of block transfer  */
#define   DMA_CHEVCTRL_EVOMODE_STRB_ON_CELL_XFER_Val _UINT32_(0x1)                                        /* (DMA_CHEVCTRL) Generate a channel event strobe for 1 clock cycle at the end of cell transfer  */
#define   DMA_CHEVCTRL_EVOMODE_STRB_START_EVT_TRG_TO_CELL_XFER_READ_Val _UINT32_(0x2)                                        /* (DMA_CHEVCTRL) Generate a channel event strobe from start event trigger to the completion of cell transfer read  */
#define   DMA_CHEVCTRL_EVOMODE_STRB_START_EVT_TRG_TO_CELL_XFER_WRITE_Val _UINT32_(0x3)                                        /* (DMA_CHEVCTRL) Generate a channel event strobe from start event trigger to the completion of cell transfer write  */
#define DMA_CHEVCTRL_EVOMODE_STRB_ON_BLCK_XFER (DMA_CHEVCTRL_EVOMODE_STRB_ON_BLCK_XFER_Val << DMA_CHEVCTRL_EVOMODE_Pos) /* (DMA_CHEVCTRL) Generate a channel event strobe for 1 clock cycle at the end of block transfer Position  */
#define DMA_CHEVCTRL_EVOMODE_STRB_ON_CELL_XFER (DMA_CHEVCTRL_EVOMODE_STRB_ON_CELL_XFER_Val << DMA_CHEVCTRL_EVOMODE_Pos) /* (DMA_CHEVCTRL) Generate a channel event strobe for 1 clock cycle at the end of cell transfer Position  */
#define DMA_CHEVCTRL_EVOMODE_STRB_START_EVT_TRG_TO_CELL_XFER_READ (DMA_CHEVCTRL_EVOMODE_STRB_START_EVT_TRG_TO_CELL_XFER_READ_Val << DMA_CHEVCTRL_EVOMODE_Pos) /* (DMA_CHEVCTRL) Generate a channel event strobe from start event trigger to the completion of cell transfer read Position  */
#define DMA_CHEVCTRL_EVOMODE_STRB_START_EVT_TRG_TO_CELL_XFER_WRITE (DMA_CHEVCTRL_EVOMODE_STRB_START_EVT_TRG_TO_CELL_XFER_WRITE_Val << DMA_CHEVCTRL_EVOMODE_Pos) /* (DMA_CHEVCTRL) Generate a channel event strobe from start event trigger to the completion of cell transfer write Position  */
#define DMA_CHEVCTRL_EVAUXIE_Pos              _UINT32_(5)                                          /* (DMA_CHEVCTRL) Channel Auxiliary Event Enable (0: disable; 1: enable) Position */
#define DMA_CHEVCTRL_EVAUXIE_Msk              (_UINT32_(0x1) << DMA_CHEVCTRL_EVAUXIE_Pos)          /* (DMA_CHEVCTRL) Channel Auxiliary Event Enable (0: disable; 1: enable) Mask */
#define DMA_CHEVCTRL_EVAUXIE(value)           (DMA_CHEVCTRL_EVAUXIE_Msk & (_UINT32_(value) << DMA_CHEVCTRL_EVAUXIE_Pos)) /* Assigment of value for EVAUXIE in the DMA_CHEVCTRL register */
#define DMA_CHEVCTRL_EVSTRIE_Pos              _UINT32_(6)                                          /* (DMA_CHEVCTRL) Channel Start Event Input Enable (0: disable; 1:enable) Position */
#define DMA_CHEVCTRL_EVSTRIE_Msk              (_UINT32_(0x1) << DMA_CHEVCTRL_EVSTRIE_Pos)          /* (DMA_CHEVCTRL) Channel Start Event Input Enable (0: disable; 1:enable) Mask */
#define DMA_CHEVCTRL_EVSTRIE(value)           (DMA_CHEVCTRL_EVSTRIE_Msk & (_UINT32_(value) << DMA_CHEVCTRL_EVSTRIE_Pos)) /* Assigment of value for EVSTRIE in the DMA_CHEVCTRL register */
#define DMA_CHEVCTRL_EVOE_Pos                 _UINT32_(7)                                          /* (DMA_CHEVCTRL) Channel Event Output Enable (0: disable; 1: enable) Position */
#define DMA_CHEVCTRL_EVOE_Msk                 (_UINT32_(0x1) << DMA_CHEVCTRL_EVOE_Pos)             /* (DMA_CHEVCTRL) Channel Event Output Enable (0: disable; 1: enable) Mask */
#define DMA_CHEVCTRL_EVOE(value)              (DMA_CHEVCTRL_EVOE_Msk & (_UINT32_(value) << DMA_CHEVCTRL_EVOE_Pos)) /* Assigment of value for EVOE in the DMA_CHEVCTRL register */
#define DMA_CHEVCTRL_Msk                      _UINT32_(0x000000EF)                                 /* (DMA_CHEVCTRL) Register Mask  */


/* -------- DMA_CHINTENCLR : (DMA Offset: 0x0C) (R/W 32) CHANNEL INTERRUPT ENABLE CLEAR REGISTER -------- */
#define DMA_CHINTENCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (DMA_CHINTENCLR) CHANNEL INTERRUPT ENABLE CLEAR REGISTER  Reset Value */

#define DMA_CHINTENCLR_SD_Pos                 _UINT32_(0)                                          /* (DMA_CHINTENCLR) Channel Event Output Enable Position */
#define DMA_CHINTENCLR_SD_Msk                 (_UINT32_(0x1) << DMA_CHINTENCLR_SD_Pos)             /* (DMA_CHINTENCLR) Channel Event Output Enable Mask */
#define DMA_CHINTENCLR_SD(value)              (DMA_CHINTENCLR_SD_Msk & (_UINT32_(value) << DMA_CHINTENCLR_SD_Pos)) /* Assigment of value for SD in the DMA_CHINTENCLR register */
#define DMA_CHINTENCLR_TA_Pos                 _UINT32_(1)                                          /* (DMA_CHINTENCLR) Clear Transfer Abort Interrupt Enable Position */
#define DMA_CHINTENCLR_TA_Msk                 (_UINT32_(0x1) << DMA_CHINTENCLR_TA_Pos)             /* (DMA_CHINTENCLR) Clear Transfer Abort Interrupt Enable Mask */
#define DMA_CHINTENCLR_TA(value)              (DMA_CHINTENCLR_TA_Msk & (_UINT32_(value) << DMA_CHINTENCLR_TA_Pos)) /* Assigment of value for TA in the DMA_CHINTENCLR register */
#define DMA_CHINTENCLR_CC_Pos                 _UINT32_(2)                                          /* (DMA_CHINTENCLR) Clear Cell Transfer Complete Interrupt Enable Position */
#define DMA_CHINTENCLR_CC_Msk                 (_UINT32_(0x1) << DMA_CHINTENCLR_CC_Pos)             /* (DMA_CHINTENCLR) Clear Cell Transfer Complete Interrupt Enable Mask */
#define DMA_CHINTENCLR_CC(value)              (DMA_CHINTENCLR_CC_Msk & (_UINT32_(value) << DMA_CHINTENCLR_CC_Pos)) /* Assigment of value for CC in the DMA_CHINTENCLR register */
#define DMA_CHINTENCLR_BC_Pos                 _UINT32_(3)                                          /* (DMA_CHINTENCLR) Clear Cell Transfer Complete Interrupt Enable Position */
#define DMA_CHINTENCLR_BC_Msk                 (_UINT32_(0x1) << DMA_CHINTENCLR_BC_Pos)             /* (DMA_CHINTENCLR) Clear Cell Transfer Complete Interrupt Enable Mask */
#define DMA_CHINTENCLR_BC(value)              (DMA_CHINTENCLR_BC_Msk & (_UINT32_(value) << DMA_CHINTENCLR_BC_Pos)) /* Assigment of value for BC in the DMA_CHINTENCLR register */
#define DMA_CHINTENCLR_BH_Pos                 _UINT32_(4)                                          /* (DMA_CHINTENCLR) Clear Block Transfer Half Complete Interrupt Enable Position */
#define DMA_CHINTENCLR_BH_Msk                 (_UINT32_(0x1) << DMA_CHINTENCLR_BH_Pos)             /* (DMA_CHINTENCLR) Clear Block Transfer Half Complete Interrupt Enable Mask */
#define DMA_CHINTENCLR_BH(value)              (DMA_CHINTENCLR_BH_Msk & (_UINT32_(value) << DMA_CHINTENCLR_BH_Pos)) /* Assigment of value for BH in the DMA_CHINTENCLR register */
#define DMA_CHINTENCLR_LL_Pos                 _UINT32_(5)                                          /* (DMA_CHINTENCLR) Clear Linked List Done Interrupt Enable Position */
#define DMA_CHINTENCLR_LL_Msk                 (_UINT32_(0x1) << DMA_CHINTENCLR_LL_Pos)             /* (DMA_CHINTENCLR) Clear Linked List Done Interrupt Enable Mask */
#define DMA_CHINTENCLR_LL(value)              (DMA_CHINTENCLR_LL_Msk & (_UINT32_(value) << DMA_CHINTENCLR_LL_Pos)) /* Assigment of value for LL in the DMA_CHINTENCLR register */
#define DMA_CHINTENCLR_Msk                    _UINT32_(0x0000003F)                                 /* (DMA_CHINTENCLR) Register Mask  */


/* -------- DMA_CHINTENSET : (DMA Offset: 0x10) (R/W 32) CHANNEL INTERRUPT ENABLE SET REGISTER -------- */
#define DMA_CHINTENSET_RESETVALUE             _UINT32_(0x00)                                       /*  (DMA_CHINTENSET) CHANNEL INTERRUPT ENABLE SET REGISTER  Reset Value */

#define DMA_CHINTENSET_SD_Pos                 _UINT32_(0)                                          /* (DMA_CHINTENSET) Channel Event Output Enable Position */
#define DMA_CHINTENSET_SD_Msk                 (_UINT32_(0x1) << DMA_CHINTENSET_SD_Pos)             /* (DMA_CHINTENSET) Channel Event Output Enable Mask */
#define DMA_CHINTENSET_SD(value)              (DMA_CHINTENSET_SD_Msk & (_UINT32_(value) << DMA_CHINTENSET_SD_Pos)) /* Assigment of value for SD in the DMA_CHINTENSET register */
#define DMA_CHINTENSET_TA_Pos                 _UINT32_(1)                                          /* (DMA_CHINTENSET) Set Transfer Abort Interrupt Enable Position */
#define DMA_CHINTENSET_TA_Msk                 (_UINT32_(0x1) << DMA_CHINTENSET_TA_Pos)             /* (DMA_CHINTENSET) Set Transfer Abort Interrupt Enable Mask */
#define DMA_CHINTENSET_TA(value)              (DMA_CHINTENSET_TA_Msk & (_UINT32_(value) << DMA_CHINTENSET_TA_Pos)) /* Assigment of value for TA in the DMA_CHINTENSET register */
#define DMA_CHINTENSET_CC_Pos                 _UINT32_(2)                                          /* (DMA_CHINTENSET) set Cell Transfer Complete Interrupt Enable Position */
#define DMA_CHINTENSET_CC_Msk                 (_UINT32_(0x1) << DMA_CHINTENSET_CC_Pos)             /* (DMA_CHINTENSET) set Cell Transfer Complete Interrupt Enable Mask */
#define DMA_CHINTENSET_CC(value)              (DMA_CHINTENSET_CC_Msk & (_UINT32_(value) << DMA_CHINTENSET_CC_Pos)) /* Assigment of value for CC in the DMA_CHINTENSET register */
#define DMA_CHINTENSET_BC_Pos                 _UINT32_(3)                                          /* (DMA_CHINTENSET) set Cell Transfer Complete Interrupt Enable Position */
#define DMA_CHINTENSET_BC_Msk                 (_UINT32_(0x1) << DMA_CHINTENSET_BC_Pos)             /* (DMA_CHINTENSET) set Cell Transfer Complete Interrupt Enable Mask */
#define DMA_CHINTENSET_BC(value)              (DMA_CHINTENSET_BC_Msk & (_UINT32_(value) << DMA_CHINTENSET_BC_Pos)) /* Assigment of value for BC in the DMA_CHINTENSET register */
#define DMA_CHINTENSET_BH_Pos                 _UINT32_(4)                                          /* (DMA_CHINTENSET) set Block Transfer Half Complete Interrupt Enable Position */
#define DMA_CHINTENSET_BH_Msk                 (_UINT32_(0x1) << DMA_CHINTENSET_BH_Pos)             /* (DMA_CHINTENSET) set Block Transfer Half Complete Interrupt Enable Mask */
#define DMA_CHINTENSET_BH(value)              (DMA_CHINTENSET_BH_Msk & (_UINT32_(value) << DMA_CHINTENSET_BH_Pos)) /* Assigment of value for BH in the DMA_CHINTENSET register */
#define DMA_CHINTENSET_LL_Pos                 _UINT32_(5)                                          /* (DMA_CHINTENSET) set Linked List Done Interrupt Enable Position */
#define DMA_CHINTENSET_LL_Msk                 (_UINT32_(0x1) << DMA_CHINTENSET_LL_Pos)             /* (DMA_CHINTENSET) set Linked List Done Interrupt Enable Mask */
#define DMA_CHINTENSET_LL(value)              (DMA_CHINTENSET_LL_Msk & (_UINT32_(value) << DMA_CHINTENSET_LL_Pos)) /* Assigment of value for LL in the DMA_CHINTENSET register */
#define DMA_CHINTENSET_Msk                    _UINT32_(0x0000003F)                                 /* (DMA_CHINTENSET) Register Mask  */


