Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/dma.h
#define DMA_INTSTAT4_CH_Pos                   _UINT32_(0)                                          /* (DMA_INTSTAT4 Position) DMA Channel active interrupt at priority 4 */
#define DMA_INTSTAT4_CH_Msk                   (_UINT32_(0xFFFFFF) << DMA_INTSTAT4_CH_Pos)          /* (DMA_INTSTAT4 Mask) CH */
#define DMA_INTSTAT4_CH(value)                (DMA_INTSTAT4_CH_Msk & (_UINT32_(value) << DMA_INTSTAT4_CH_Pos)) 

/* -------- DMA_INTSTAT3 : (DMA Offset: 0x18) ( R/ 32) DMA INTERRUPT PRIORITY 3 STATUS REGISTER -------- */
#define DMA_INTSTAT3_RESETVALUE               _UINT32_(0x00)                                       /*  (DMA_INTSTAT3) DMA INTERRUPT PRIORITY 3 STATUS REGISTER  Reset Value */

#define DMA_INTSTAT3_CH0_Pos                  _UINT32_(0)                                          /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH0_Msk                  (_UINT32_(0x1) << DMA_INTSTAT3_CH0_Pos)              /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH0(value)               (DMA_INTSTAT3_CH0_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH0_Pos)) /* Assigment of value for CH0 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH1_Pos                  _UINT32_(1)                                          /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH1_Msk                  (_UINT32_(0x1) << DMA_INTSTAT3_CH1_Pos)              /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH1(value)               (DMA_INTSTAT3_CH1_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH1_Pos)) /* Assigment of value for CH1 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH2_Pos                  _UINT32_(2)                                          /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH2_Msk                  (_UINT32_(0x1) << DMA_INTSTAT3_CH2_Pos)              /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH2(value)               (DMA_INTSTAT3_CH2_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH2_Pos)) /* Assigment of value for CH2 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH3_Pos                  _UINT32_(3)                                          /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH3_Msk                  (_UINT32_(0x1) << DMA_INTSTAT3_CH3_Pos)              /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH3(value)               (DMA_INTSTAT3_CH3_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH3_Pos)) /* Assigment of value for CH3 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH4_Pos                  _UINT32_(4)                                          /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH4_Msk                  (_UINT32_(0x1) << DMA_INTSTAT3_CH4_Pos)              /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH4(value)               (DMA_INTSTAT3_CH4_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH4_Pos)) /* Assigment of value for CH4 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH5_Pos                  _UINT32_(5)                                          /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH5_Msk                  (_UINT32_(0x1) << DMA_INTSTAT3_CH5_Pos)              /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH5(value)               (DMA_INTSTAT3_CH5_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH5_Pos)) /* Assigment of value for CH5 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH6_Pos                  _UINT32_(6)                                          /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH6_Msk                  (_UINT32_(0x1) << DMA_INTSTAT3_CH6_Pos)              /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH6(value)               (DMA_INTSTAT3_CH6_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH6_Pos)) /* Assigment of value for CH6 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH7_Pos                  _UINT32_(7)                                          /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH7_Msk                  (_UINT32_(0x1) << DMA_INTSTAT3_CH7_Pos)              /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH7(value)               (DMA_INTSTAT3_CH7_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH7_Pos)) /* Assigment of value for CH7 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH8_Pos                  _UINT32_(8)                                          /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH8_Msk                  (_UINT32_(0x1) << DMA_INTSTAT3_CH8_Pos)              /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH8(value)               (DMA_INTSTAT3_CH8_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH8_Pos)) /* Assigment of value for CH8 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH9_Pos                  _UINT32_(9)                                          /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH9_Msk                  (_UINT32_(0x1) << DMA_INTSTAT3_CH9_Pos)              /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH9(value)               (DMA_INTSTAT3_CH9_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH9_Pos)) /* Assigment of value for CH9 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH10_Pos                 _UINT32_(10)                                         /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH10_Msk                 (_UINT32_(0x1) << DMA_INTSTAT3_CH10_Pos)             /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH10(value)              (DMA_INTSTAT3_CH10_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH10_Pos)) /* Assigment of value for CH10 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH11_Pos                 _UINT32_(11)                                         /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH11_Msk                 (_UINT32_(0x1) << DMA_INTSTAT3_CH11_Pos)             /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH11(value)              (DMA_INTSTAT3_CH11_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH11_Pos)) /* Assigment of value for CH11 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH12_Pos                 _UINT32_(12)                                         /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH12_Msk                 (_UINT32_(0x1) << DMA_INTSTAT3_CH12_Pos)             /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH12(value)              (DMA_INTSTAT3_CH12_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH12_Pos)) /* Assigment of value for CH12 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH13_Pos                 _UINT32_(13)                                         /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH13_Msk                 (_UINT32_(0x1) << DMA_INTSTAT3_CH13_Pos)             /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH13(value)              (DMA_INTSTAT3_CH13_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH13_Pos)) /* Assigment of value for CH13 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH14_Pos                 _UINT32_(14)                                         /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH14_Msk                 (_UINT32_(0x1) << DMA_INTSTAT3_CH14_Pos)             /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH14(value)              (DMA_INTSTAT3_CH14_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH14_Pos)) /* Assigment of value for CH14 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH15_Pos                 _UINT32_(15)                                         /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH15_Msk                 (_UINT32_(0x1) << DMA_INTSTAT3_CH15_Pos)             /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH15(value)              (DMA_INTSTAT3_CH15_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH15_Pos)) /* Assigment of value for CH15 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH16_Pos                 _UINT32_(16)                                         /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH16_Msk                 (_UINT32_(0x1) << DMA_INTSTAT3_CH16_Pos)             /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH16(value)              (DMA_INTSTAT3_CH16_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH16_Pos)) /* Assigment of value for CH16 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH17_Pos                 _UINT32_(17)                                         /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH17_Msk                 (_UINT32_(0x1) << DMA_INTSTAT3_CH17_Pos)             /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH17(value)              (DMA_INTSTAT3_CH17_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH17_Pos)) /* Assigment of value for CH17 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH18_Pos                 _UINT32_(18)                                         /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH18_Msk                 (_UINT32_(0x1) << DMA_INTSTAT3_CH18_Pos)             /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH18(value)              (DMA_INTSTAT3_CH18_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH18_Pos)) /* Assigment of value for CH18 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH19_Pos                 _UINT32_(19)                                         /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH19_Msk                 (_UINT32_(0x1) << DMA_INTSTAT3_CH19_Pos)             /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH19(value)              (DMA_INTSTAT3_CH19_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH19_Pos)) /* Assigment of value for CH19 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH20_Pos                 _UINT32_(20)                                         /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH20_Msk                 (_UINT32_(0x1) << DMA_INTSTAT3_CH20_Pos)             /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH20(value)              (DMA_INTSTAT3_CH20_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH20_Pos)) /* Assigment of value for CH20 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH21_Pos                 _UINT32_(21)                                         /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH21_Msk                 (_UINT32_(0x1) << DMA_INTSTAT3_CH21_Pos)             /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH21(value)              (DMA_INTSTAT3_CH21_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH21_Pos)) /* Assigment of value for CH21 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH22_Pos                 _UINT32_(22)                                         /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH22_Msk                 (_UINT32_(0x1) << DMA_INTSTAT3_CH22_Pos)             /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH22(value)              (DMA_INTSTAT3_CH22_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH22_Pos)) /* Assigment of value for CH22 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_CH23_Pos                 _UINT32_(23)                                         /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Position */
#define DMA_INTSTAT3_CH23_Msk                 (_UINT32_(0x1) << DMA_INTSTAT3_CH23_Pos)             /* (DMA_INTSTAT3) DMA Channel active interrupt at priority 3 Mask */
#define DMA_INTSTAT3_CH23(value)              (DMA_INTSTAT3_CH23_Msk & (_UINT32_(value) << DMA_INTSTAT3_CH23_Pos)) /* Assigment of value for CH23 in the DMA_INTSTAT3 register */
#define DMA_INTSTAT3_Msk                      _UINT32_(0x00FFFFFF)                                 /* (DMA_INTSTAT3) Register Mask  */

